
var quotes = [
    {  quote : "التوقيت: افحصوا التوقيت الصحيح لبدء عملية إنقاص الوزن. من أجل النجاح في عملية إنقاص الوزن، يجب فحص ما إذا كان الوقت مناسبًا للمباشرة بهذه المهمة ام لا. واسألوا أنفسكم: هل لدي ما يكفي من الطاقة؟ هل أنا على استعداد لتخصيص الوقت والتفكير اللازمين لتنفيذ المهمة؟ هل أنا هادئ ومطمئن الان ومتحرر من ضغوط البيت والعمل التي قد تعرقل برامجي وتمنعني من تخصيص الوقت والطاقة للنجاح في هذه المهمة؟ تتعلق غالبية احتمالات النجاح في هذه المهمة، بالأساس، بكونكم متفرغين للقيام بإجراء هذه التغييرات على نمط حياتكم." },
    {  quote : "اختيار البرنامج: في حال قررتم إنقاص وزنكم، عليكم اختيار برنامج أثبتت نجاعته ونجاحه علميا، وتنفيذه تحت إشراف وتوجيه أشخاص مهنيين. تعتبر زيادة الوزن والسمنة من المشاكل الصحية المزمنة، ذات المضاعفات الصحية الخطيرة. لذلك فإنها تستدعي علاجًا ومتابعة طبية كأي مشكلة طبية أخرى (فرط ضغط الدم، ارتفاع نسبة الدهنيات في الدم). كما يجب الانتباه لكون التغذية التي تستهلكونها متوازنة. إذ من غير الوراد أن يسبب نظام التغذية الذي تتبعونه أي نقص غذائي تعانون منه مستقبلاً." },
    {  quote : "المواظبة على المراقبة: هل يتضمن البرنامج الذي تتبعونه متابعة متواصلة ثابتة على مدى عدة سنوات؟ هنالك ما لا يحصى من الطرق الممكن اتباعها لإنقاص الوزن، لكن الصعوبة الحقيقية تكمن في تثبيت الوزن والحفاظ على الإنجاز. تعتبر عودة ازدياد الوزن مشكلة مزمنة تستوجب المتابعة المتواصلة والمثابرة على مدار مدة زمنية طويلة، كأي مشكلة طبية مزمنة أخرى. بشكل عام، يساهم الالتزام بالإطار المحدد والرقابة المتواصلة، بدرجة كبيرة، في تثبيت الوزن." },
    {  quote : "علاج مهني متعدد المجالات: تشير الكثير من الأبحاث التي نشرت في الصحف المتخصصة إلى أن الأشخاص الذين ينجحون في إنقاص وزنهم وتحسين صحتهم وجودة حياتهم لفترة زمنية، اتبعوا طرق العلاج التي تشمل: توجيهًا مهنيًا للتغذية السليمة، نشاطًا بدنيا مناسبًا، تغييرًا سلوكيًا تدريجيًا ومتواصلاً، وعلاجًا طبيًا تقليديًا وفقًا للوضع الصحي. يزيد هذا العلاج من نسبة خفض الوزن، ويحسن الوضع الصحي (يساعد في موازنة ضغط الدم، الدهنيات في الدم، السكر في الدم). بشكل عام، ينجح الأشخاص الذين انقصوا وزنهم باتباع مثل هذا الدمج العلاجي، بالحفاظ على وزن سليم وتثبيت الوزن لمدة زمنية أطول، مقارنة بالأشخاص الذين أنقصوا من وزنهم باتباع النظام الغذائي فحسب." },
    {  quote : "تحديد الأهداف: تكمن المشكلة الرئيسية في القسم الأكبر من قرارات إنقاص الوزن - وهي قرارات عامة - في كونها غير محددة الأهداف. كما تكون في كثير من الأحول، غير عملية. يجب تحديد الأهداف للمدى القريب والمدى البعيد منذ بداية الطريق. يجب ألا تقتصر الأهداف على تحديد الوزن المرغوب الوصول إليه، وإنما تحديد الوسائل التي سيتم اتباعها من أجل بلوغ هذا الوزن. إن قولنا سأباشر الأسبوع المقبل بممارسة النشاط الرياضي هو هدف عام جدًا، وغير قابل للقياس. من المفضل تحديد نوع النشاط المنوي ممارسته، وكذلك مكان القيام به والمدة الزمنية المخصصة لهذا النشاط. بمعنى ان نقول: سأمارس المشي في الحديقة لمدة 20 دقيقة في أيام الأحد، الثلاثاء والخميس. مثال اخر لهدف محدد يمكن أن يكون أكل ثلاث وجبات يوميًا في ساعات ثابتة، ابتداءً من تاريخ معين" },
    {  quote : "موعد بلوغ الهدف: يكمن الفرق الأساسي بين الغاية والأمنية، في أن للغاية موعد محدد لبلوغها، أما الأمنية فلا. من المهم تحديد موعد نهائي لبلوغ الهدف، وكذلك مواعيد مرحلية وسطى تستعمل كعلامات على الطريق قبل الوصول إلى نقطة الهدف. الغاية  الموصى بتحديدها على المدى البعيد هي فقدان حوالي 10% من الوزن الابتدائي خلال نصف عام من بدء المهمة. يجب أن تتراوح وتيرة فقدان الوزن بين نصف كيلوجرام حتى كيلوجرام واحد أسبوعيًا، مع مراقبة أسبوعية للوزن." },
    { quote : "رقابة المهمة: من المحبذ تحديد موعد يومي، واخر أسبوعي من أجل فحص ما إذا كنتم قد نفذتم كل المهام التي وضعتموها لأنفسكم هذا الأسبوع. اليوم، مع نمط الحياة المليء بالمشاغل، يتعين علينا إيجاد الوقت والتخطيط للوجبات الصحية وللنشاط الرياضي خلال ساعات اليوم. هذه المهمات صعبة، ولكن يجب وضعها كأولوية قصوى، كما يجب تخصيص الوقت الكافي لها في برنامجنا الأسبوعي. فكما أنك تخطط للقاءاتك، يجب عليك تخصيص وقت للقاء أهم إنسان في حياتك، ألا وهو أنت. خصصوا لأنفسكم وقتًا في دفتر يومياتكم من اجل تخطيط برنامج الوجبات والنشاطات البدنية، واهتموا بتنفيذها." },
    {  quote : "بشكل عام، عند إجراء أي تغيير في الحياة، علينا التعامل مع الصعوبات التي تواجهنا على الطريق. الصعوبات موجودة أيضا في عملية الاهتمام بالوزن. من المحبذ فحص ماهية الصعوبات مسبقا، وكذلك أسباب الفشل في اتباع الأنظمة الغذائية في السابق. من المرجح أن تواجهوا ذات العوائق هذه المرة أيضًا. عندما تقومون بتسجيل كل الصعوبات والعوائق التي واجهتموها في المحاولات السابقة لإنقاص الوزن، سيزداد انتباهكم، وستحاولون إيجاد طرق جديدة لحل هذه المشاكل." },
    {  quote : "اكتساب مهارات جديدة: إن تحقيق الأهداف في الحياة، كثيرًا ما يستوجب تعلم مهارات جديدة، وإتقانها جيداً لأجل بلوغ الهدف. لكن إن أردتم أمثله لبعض المهارات التي عليكم اكتسابها من أجل تثبيت الوزن والحفاظ على وزن سليم، " },
    {  quote : " العلاج الذهني: يبدأ فقدان الوزن الصحي دائمًا من الرأس. على أي برنامج لخفض الوزن وتثبيت الوزن أن يرتكز على الدمج بين التوجيه لإجراء تغييرات خارجية على نمط الحياة - مثل طريقة الأكل، النشاط الجسماني- وبين التوجيه لإجراء التغييرات الداخلية، مثل- تغيير التفكير والتوجه للأكل، وتبني عادات حياتية صحية." },


]
var generateBtn = document.getElementById('generateBtn');
var showQuote = document.getElementById('showQuote');

function generateRandom(){
    return  Math.floor(Math.random()* quotes.length )    
}

generateBtn.onclick = function(){
    var randomNumber = generateRandom()
    var selectQuote = quotes[randomNumber]
    showQuote.innerHTML = `
    <h4 class="p-4 h4">" ${selectQuote.quote}"</h4>
       `
}
 
